Autodesk.Revit.DB.ContourSettingItemType
The type of a ContourSettingItem
Since:
2025
Since:
2025

Autodesk.Revit.DB.ContourSettingItemType.BoundedRange
The item contains contour lines in a bounded range.

Autodesk.Revit.DB.ContourSettingItemType.UnboundedRange
The item contains contour lines in an unbounded range.

Autodesk.Revit.DB.ContourSettingItemType.Single
The item only contains a single contour line.